{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "829be61c",
   "metadata": {},
   "source": [
    "№ 11951 (Уровень: Сложный)\n",
    "\n",
    "(PRO100 ЕГЭ) Два игрока, Петя и Ваня, играют в следующую игру. Дан набор слов, составленных из букв русского алфавита, при этом ни одно из заданных слов не является началом другого. Слова в этой игре – это просто цепочки букв, они не обязаны быть осмысленными словами русского языка. Игра состоит в том, что игроки составляют слово из набора, приписывая по очереди буквы к концу составляемого слова, т.е. справа. При этом каждое промежуточное слово должно быть началом одного из заданных слов. Выигрывает тот, кто получит одно из заданных слов целиком. Первый ход делает Петя, т.е. Петя пишет первую букву составляемого слова.\n",
    "\n",
    "Пример. Заданный набор слов: {АНТАРКТИДА, АНТРАЦИТ, АБАРА, АБАЖУР, БББ, БАОБАБ, БАР}.\n",
    "Первым ходом Петя пишет Б (он мог написать Б или А).\n",
    "Ваня в ответ дописывает А и получает БА (он мог ещё получить ББ).\n",
    "Вторым ходом Петя получает БАР и выигрывает.\n",
    "\n",
    "В заданиях используются следующие понятия. Стратегия игрока – это правило, указывающее игроку ход, который он должен сделать. Описать стратегию игрока – значит описать, какой ход он должен сделать в любой ситуации, которая ему может встретиться при различной игре противника. Стратегия игрока называется выигрышной, если игрок выигрывает в любой партии, разыгранной в соответствии с этой стратегией, как бы ни играл противник.\n",
    "\n",
    "Множество всех партий, которые могут получиться при данной стратегии, представляется в виде дерева, это дерево называется деревом всех партий для заданной стратегии. В узлах дерева – позиции игры; на рёбрах – ходы, которые переводят одну позицию в другую; корень дерева – начальная позиция игры. Дерево всех партий для данной стратегии можно описать с помощью рисунка или таблицы.\n",
    "\n",
    "Укажите, у кого есть выигрышная стратегия при исходном наборе слов {АБВГДАБВГДХ, ДГВБАДГВБЕ}. Сколько различных партий возможно при этой стратегии? \n",
    "\n",
    "В ответе напишите букву П, если выигрышная стратегия есть у Пети, или В, если выигрышная стратегия есть у Вани. Сразу после буквы напишите число, обозначающее, количество различных партий возможных при этой стратегии.\n",
    "\n",
    "Так, например, если у Вани есть выигрышная стратегия. И всего возможно 68 партий. Тогда в ответ нужно записать В68.\n",
    "\n",
    "Задание 20.\n",
    "В задании 19 поменяйте местами две буквы в более коротком слове так, чтобы теперь выигрышная стратегия была у другого игрока. Запишите в ответ изменённое слово.\n",
    "\n",
    "\n",
    "Задание 21.\n",
    "Рассмотрим набор слов {ВОРОНА, ВОЛК, ВОЛНА, МОРИС, МОРЯНА, МОРКОВЬ}. У кого из игроков есть выигрышная стратегия для этого набора? Сколько всего возможно партий при этой стратегии?\n",
    "\n",
    "В ответе напишите букву П, если выигрышная стратегия есть у Пети, или В, если выигрышная стратегия есть у Вани. Сразу после буквы напишите число, обозначающее, количество различных партий возможных при этой стратегии.\n",
    "\n",
    "Так, например, если у Вани есть выигрышная стратегия. И всего возможно 68 партий. Тогда в ответ нужно записать В68."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "e90db95c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n"
     ]
    }
   ],
   "source": [
    "from functools import lru_cache\n",
    "\n",
    "@lru_cache(None)\n",
    "def f(a, m):\n",
    "    if a in [\"АБВГДАБВГДХ\", \"ДГВБАДГВБЕ\"]:\n",
    "        if m % 2 == 0: \n",
    "            return 1\n",
    "        return 0\n",
    "    \n",
    "    if m == 0:\n",
    "        return 0\n",
    "    \n",
    "    h = [f(a + i, m - 1) for i in set(max([\"АБВГДАБВГДХ\", \"ДГВБАДГВБЕ\"]))]\n",
    "\n",
    "    if m % 2 == 1:\n",
    "        return sum(h)\n",
    "    else:\n",
    "        if not all(h): \n",
    "            return 0\n",
    "        return sum(h)\n",
    "\n",
    "print(f(\"\", len(max([\"АБВГДАБВГДХ\", \"ДГВБАДГВБЕ\"]))))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "786cb557",
   "metadata": {},
   "source": [
    "Честно говоря я хз почему 0 выводит"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv (3.13.2)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
