{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "81f179d1",
   "metadata": {},
   "source": [
    "№ 8419 (Уровень: Средний)\n",
    "\n",
    "Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежат две кучи камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в большую кучу любое количество камней от одного до трёх или удвоить количество камней в меньшей куче. Если кучи содержат равное количество камней, можно добавить в любую из них от одного до трёх камней, удвоение в этой ситуации запрещено. Игра завершается, когда общее количество камней в кучах становится более 46 Победителем считается игрок, сделавший последний ход, то есть первым получивший 47 или больше камней в двух кучах. Известно, что Петя смог выиграть первым ходом. Какое наименьшее число камней могло быть суммарно в двух кучах?\n",
    "\n",
    "Задание 20. В игре, описанной в задании 19, в начальный момент в первой куче было 5 камней, а во второй – S камней, 1 ≤ S ≤ 41 Укажите минимальное и максимальное из таких значений S, при которых Петя не может выиграть первым ходом, но у Пети есть выигрышная стратегия, позволяющая ему выиграть вторым ходом при любой игре Вани. В ответе запишите сначала минимальное значение, затем максимальное.\n",
    "\n",
    "Задание 21. В игре, описанной в задании 19, в начальный момент в первой куче было 22 камня, а во второй – S камней, 1 ≤ S ≤ 24 Найдите такое значение S, при котором у Вани есть стратегия, позволяющая ему выиграть вторым ходом при любой игре Пети, но у Вани нет стратегии, которая позволяла бы ему гарантированно выиграть первым ходом."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3f2a4ac1",
   "metadata": {},
   "outputs": [],
   "source": [
    "def f(a, b, m):\n",
    "    if a + b >= 47:\n",
    "        return m % 2 == 0\n",
    "    \n",
    "    if m == 0:\n",
    "        return False\n",
    "\n",
    "    if a == b:\n",
    "        h = [f(a + i, b, m - 1) for i in range(1, 4)] + [f(a, b + i, m - 1) for i in range(1, 4)]\n",
    "    if a > b:\n",
    "        h = [f(a + i, b, m - 1) for i in range(1, 4)] + [f(a, b * 2, m - 1)]\n",
    "    else:\n",
    "        h = [f(a, b + i, m - 1) for i in range(1, 4)] + [f(a * 2, b, m - 1)]\n",
    "    \n",
    "    if m % 2 == 0:\n",
    "        return all(h)\n",
    "    return any(h)\n",
    "\n",
    "ans = []\n",
    "\n",
    "for s1 in range(0, 47):\n",
    "    for s2 in range(0, 47):\n",
    "        if f(s1, s2, 1) == True:\n",
    "            ans.append(s1 + s2)\n",
    "print(*ans)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv (3.13.2)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.13.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
