{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "330d2ba1",
   "metadata": {},
   "source": [
    "\t\n",
    "№ 23329 (Уровень: Средний)\n",
    "\n",
    "(О. Лысенков) Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит две кучи камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может:\n",
    "\n",
    "- убрать из первой кучи 5 камней;\n",
    "\n",
    "- убрать из второй кучи 3 камня;\n",
    "\n",
    "- уменьшить количество камней в куче в два раза (в случае с первой кучей количество камней, полученное при делении, округляется до меньшего целого, а в случае со второй кучей до большего целого). Например из позиции (41, 23) можно получить позиции (36, 23); (46,20); (20, 23); (20, 12).\n",
    "\n",
    "Игра завершается в тот момент, когда суммарное количество камней в кучах становится не более 60. Победителем считается игрок, сделавший последний ход, т.е. первым получивший такую позицию, при которой в кучах суммарно находится 60 камней или меньше.\n",
    "\n",
    "В начальный момент в первой куче было сто тридцать  камней, во второй куче – S камней; 5 ≤ S ≤ 150.\n",
    "\n",
    "Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.\n",
    "\n",
    "Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. Укажите наибольшее значение S, когда такая ситуация возможна.\n",
    "\n",
    "Задание 20.\n",
    "Для игры, описанной в задании 19, найдите два наименьших значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:\n",
    "\n",
    "– Петя не может выиграть за один ход;\n",
    "– Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.\n",
    "\n",
    "Найденные значения запишите в ответе в порядке возрастания.\n",
    "\n",
    "\n",
    "Задание 21.\n",
    "Для игры, описанной в задании 19, найдите произведение значений S, при которых одновременно выполняются два условия\n",
    "\n",
    "- у Пети есть выигрышная стратегия, позволяющая ему выиграть вторым или третьим ходом при любой игре Вани;\n",
    "- у Пети нет стратегии, которая позволит ему гарантированно выиграть своим первым или вторым ходом."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "abb4dcb2",
   "metadata": {},
   "source": [
    "здесь выходит RecursionError: maximum recursion depth exceeded while calling a Python object"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "481df1d7",
   "metadata": {},
   "source": [
    "№ 8419 (Уровень: Средний)\n",
    "\n",
    "Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежат две кучи камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в большую кучу любое количество камней от одного до трёх или удвоить количество камней в меньшей куче. Если кучи содержат равное количество камней, можно добавить в любую из них от одного до трёх камней, удвоение в этой ситуации запрещено.\n",
    "Игра завершается, когда общее количество камней в кучах становится более 46 Победителем считается игрок, сделавший последний ход, то есть первым получивший 47 или больше камней в двух кучах.\n",
    "Известно, что Петя смог выиграть первым ходом. Какое наименьшее число камней могло быть суммарно в двух кучах?\n",
    "\n",
    "Задание 20.\n",
    "В игре, описанной в задании 19, в начальный момент в первой куче было 5 камней, а во второй – S камней, 1 ≤ S ≤ 41\n",
    "Укажите минимальное и максимальное из таких значений S, при которых Петя не может выиграть первым ходом, но у Пети есть выигрышная стратегия, позволяющая ему выиграть вторым ходом при любой игре Вани.\n",
    "В ответе запишите сначала минимальное значение, затем максимальное.\n",
    "\n",
    "\n",
    "Задание 21.\n",
    "В игре, описанной в задании 19, в начальный момент в первой куче было 22 камня, а во второй – S камней, 1 ≤ S ≤ 24\n",
    "Найдите такое значение S, при котором у Вани есть стратегия, позволяющая ему выиграть вторым ходом при любой игре Пети, но у Вани нет стратегии, которая позволяла бы ему гарантированно выиграть первым ходом."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bc684024",
   "metadata": {},
   "outputs": [],
   "source": [
    "from functools import lru_cache\n",
    "import sys\n",
    "sys.setrecursionlimit(10**7)\n",
    "\n",
    "@lru_cache(None)\n",
    "def f(a, b , n):\n",
    "    if a + b >= 47:\n",
    "        return 0\n",
    "    \n",
    "    if a == b:\n",
    "        t = [f(a + i, b, n + 1) for i in range(1, 4)] + [f(a, b + i, n + 1) for i in range(1, 4)]\n",
    "    if a > b:\n",
    "        t = [f(a + i, b, n + 1) for i in range(1, 4)] + [f(a, b * 2, n + 1)]\n",
    "    else:\n",
    "        t = [f(a, b + i, n + 1) for i in range(1, 4)] + [f(a * 2, b, n + 1)]\n",
    "\n",
    "    n = [i for i in t if i <= 0]\n",
    "    if n:\n",
    "        return -max(n) + 1\n",
    "    return -max(t)\n",
    "    # 19\n",
    "\n",
    "ans = []\n",
    "for s1 in range(0, 46):\n",
    "    for s2 in range(0, 46):\n",
    "        if f(s1, s2, 0) == 1:\n",
    "            ans.append(s1 + s2)\n",
    "print(min(ans))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "74bb5be4",
   "metadata": {},
   "source": [
    "опять RecursionError"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv (3.13.2)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
