{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "330d2ba1",
   "metadata": {},
   "source": [
    "\t\n",
    "№ 23329 (Уровень: Средний)\n",
    "\n",
    "(О. Лысенков) Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит две кучи камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может:\n",
    "\n",
    "- убрать из первой кучи 5 камней;\n",
    "\n",
    "- убрать из второй кучи 3 камня;\n",
    "\n",
    "- уменьшить количество камней в куче в два раза (в случае с первой кучей количество камней, полученное при делении, округляется до меньшего целого, а в случае со второй кучей до большего целого). Например из позиции (41, 23) можно получить позиции (36, 23); (46,20); (20, 23); (20, 12).\n",
    "\n",
    "Игра завершается в тот момент, когда суммарное количество камней в кучах становится не более 60. Победителем считается игрок, сделавший последний ход, т.е. первым получивший такую позицию, при которой в кучах суммарно находится 60 камней или меньше.\n",
    "\n",
    "В начальный момент в первой куче было сто тридцать  камней, во второй куче – S камней; 5 ≤ S ≤ 150.\n",
    "\n",
    "Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.\n",
    "\n",
    "Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. Укажите наибольшее значение S, когда такая ситуация возможна.\n",
    "\n",
    "Задание 20.\n",
    "Для игры, описанной в задании 19, найдите два наименьших значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:\n",
    "\n",
    "– Петя не может выиграть за один ход;\n",
    "– Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.\n",
    "\n",
    "Найденные значения запишите в ответе в порядке возрастания.\n",
    "\n",
    "\n",
    "Задание 21.\n",
    "Для игры, описанной в задании 19, найдите произведение значений S, при которых одновременно выполняются два условия\n",
    "\n",
    "- у Пети есть выигрышная стратегия, позволяющая ему выиграть вторым или третьим ходом при любой игре Вани;\n",
    "- у Пети нет стратегии, которая позволит ему гарантированно выиграть своим первым или вторым ходом."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "50aa7253",
   "metadata": {},
   "outputs": [],
   "source": [
    "from math import *\n",
    "from functools import lru_cache\n",
    "import sys\n",
    "sys.setrecursionlimit(10**6)\n",
    "\n",
    "@lru_cache(None)\n",
    "def f(a, b, n):\n",
    "    if a + b <= 60:\n",
    "        return 0\n",
    "    \n",
    "    t = [f(a - 5, b, n + 1), f(a, b - 3, n + 1), f(floor(a / 2), b, n + 1), f(a, ceil(b), n + 1)]\n",
    "    n = [i for i in t if i <= 0]\n",
    "\n",
    "    if n:\n",
    "        return -max(n)\n",
    "    return -max(t)\n",
    "\n",
    "ans = []\n",
    "# 19\n",
    "for i in range(5, 151):\n",
    "    if f(130, i, 0) == -1:\n",
    "        ans.append(i)\n",
    "print(*ans)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "abb4dcb2",
   "metadata": {},
   "source": [
    "здесь выходит RecursionError: maximum recursion depth exceeded while calling a Python object"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv (3.13.2)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
