{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8100a3ac",
   "metadata": {},
   "source": [
    "Текстовый файл состоит из цифр от 1 до 6, знаков операций «–» и «*» (вычитание и умножение) и заглавных латинских букв A, B, C, D.\n",
    "\n",
    "Определите максимальное количество символов в непрерывной последовательности символов, состоящей из буквы B, за которой следует корректное арифметическое выражение с целыми неотрицательными числами, записанными в десятичной системе счисления."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "cec6024a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "68\n"
     ]
    }
   ],
   "source": [
    "from re import finditer\n",
    "file = open(r\"D:\\informaticsclass\\egeinfo\\24\\24__7h55c (1).txt\").readline()\n",
    "number = \"[1-6][1-6]*\"\n",
    "reg = f\"B{number}([-*]{number})*\"\n",
    "mx = 0\n",
    "for i in finditer(reg, file):\n",
    "    mx = max(mx, len(i.group()))\n",
    "print(mx)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "60f1cc06",
   "metadata": {},
   "source": [
    "Текстовый файл состоит из цифр 6, 7, 8, 9, 0 и знаков арифметических операций «–» и «+» (вычитание и сложение).\n",
    "Определите максимальное количество символов в непрерывной последовательности, которая является корректным арифметическим выражением с целыми неотрицательными числами. В этом выражении никакие два знака арифметических операций не стоят рядом, в записи чисел отсутствуют незначащие (ведущие) нули и число 0 не имеет знака.\n",
    "В ответе укажите количество символов."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a16bdc28",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "145\n"
     ]
    }
   ],
   "source": [
    "f = open(r\"D:\\informaticsclass\\egeinfo\\24\\24_2__7bozs.txt\").readline()\n",
    "from re import *\n",
    "mx = 0\n",
    "num = r\"([6-9][06-9]*|0)\"\n",
    "pattern = rf\"{num}([-+]{num})*\"\n",
    "for i in finditer(pattern, f):\n",
    "    mx = max(mx, len(i.group()))\n",
    "\n",
    "print(mx)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e6d9214d",
   "metadata": {},
   "source": [
    "Текстовый файл состоит из десятичных цифр и заглавных букв латинского алфавита. Определите в этом файле последовательность идущих подряд символов, представляющих собой запись максимального чётного 14-ричного числа. В ответе запишите количество символов (значащих цифр в записи числа) в этой последовательности.\n",
    "Примечание. Латинские буквы A, B, C и D означают цифры из алфавита 14-ричной системы счисления."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0adbe066",
   "metadata": {},
   "outputs": [],
   "source": [
    "from re import *\n",
    "file = open(r\"D:\\informaticsclass\\egeinfo\\24\\Задание_24__7blrn.txt\").readline()\n",
    "mx = 0\n",
    "number = \"([1-9]|[A-D])([0-9]|[A-D])*[02468AC]|0|[02468AC]\"\n",
    "\n",
    "for i in finditer(number, file):\n",
    "    mx = max(mx, len(i.group()))\n",
    "\n",
    "print(mx)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "006454bd",
   "metadata": {},
   "source": [
    "Текстовый файл состоит из цифр 0, 6, 7, 8, 9 и знаков арифметических операций «–» и «*» (вычитание и умножение). Определите максимальное количество символов в непрерывной последовательности, которая является корректным арифметическим выражением с целыми неотрицательными числами. В этом выражении никакие два знака арифметических операций не стоят рядом, в записи чисел отсутствуют незначащие (ведущие) нули и число 0 не имеет знака.\n",
    "В ответе укажите количество символов."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c50ae16b",
   "metadata": {},
   "outputs": [],
   "source": [
    "file = open(r\"D:\\informaticsclass\\egeinfo\\24\\demo_2025_24__7ae4q.txt\").readline()\n",
    "from re import *\n",
    "mx = 0\n",
    "\n",
    "number = \"[1-9][0-9]*|0\"\n",
    "reg = f\"{num}([*-]{num})+\"\n",
    "\n",
    "for i in finditer(reg, file):\n",
    "    mx = max(mx, len(i.group()))\n",
    "print(mx)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a8d2ee8f",
   "metadata": {},
   "source": [
    "Текстовый файл состоит не более чем из 106   символов и содержит только символы, обозначающие знаки «-», «*», и цифры 0, 7, 8, 9. Определите в прилагаемом файле значение арифметического выражения у подстроки, которая содержит максимальное количество идущих подряд символов, которые образуют математически правильную последовательность, в которую входят знаки «-» или «*» и натуральные числа без незначащих нулей.\n",
    "\n",
    "В ответ запишите первые 6 цифр данного числа (знак в ответ не указывать)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bad9ba61",
   "metadata": {},
   "outputs": [
    {
     "ename": "ValueError",
     "evalue": "max() iterable argument is empty",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mValueError\u001b[39m                                Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[49]\u001b[39m\u001b[32m, line 8\u001b[39m\n\u001b[32m      5\u001b[39m num = \u001b[33m\"\u001b[39m\u001b[33m[789][0789]*|0\u001b[39m\u001b[33m\"\u001b[39m\n\u001b[32m      6\u001b[39m reg = \u001b[33mf\u001b[39m\u001b[33m\"\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mnum\u001b[38;5;132;01m}\u001b[39;00m\u001b[33m([-*]\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mnum\u001b[38;5;132;01m}\u001b[39;00m\u001b[33m)*\u001b[39m\u001b[33m\"\u001b[39m\n\u001b[32m----> \u001b[39m\u001b[32m8\u001b[39m m = \u001b[38;5;28;43mmax\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43m[\u001b[49m\u001b[43mx\u001b[49m\u001b[43m.\u001b[49m\u001b[43mgroup\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mfor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43mx\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01min\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43mfinditer\u001b[49m\u001b[43m(\u001b[49m\u001b[43mreg\u001b[49m\u001b[43m,\u001b[49m\u001b[43ms\u001b[49m\u001b[43m)\u001b[49m\u001b[43m]\u001b[49m\u001b[43m,\u001b[49m\u001b[43mkey\u001b[49m\u001b[43m \u001b[49m\u001b[43m=\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mlen\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[32m     11\u001b[39m \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;28mstr\u001b[39m(\u001b[38;5;28mabs\u001b[39m(\u001b[38;5;28meval\u001b[39m(m)))[:\u001b[32m6\u001b[39m])\n",
      "\u001b[31mValueError\u001b[39m: max() iterable argument is empty"
     ]
    }
   ],
   "source": [
    "from re import *\n",
    "file = open(r\"D:\\informaticsclass\\egeinfo\\24\\24_2__6jwgo.txt\").readline()\n",
    "ans = []\n",
    "\n",
    "num = \"[789][0789]*|0\"\n",
    "reg = f\"{num}([-*]{num})*\"\n",
    "\n",
    "m = max([x.group() for x in finditer(reg,file)],key = len)\n",
    "\n",
    "\n",
    "print(str(abs(eval(m)))[:6])"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv (3.13.2)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
