{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "a54317fa",
   "metadata": {},
   "source": [
    "Текстовый файл содержит строку из заглавных латинских букв и точек, всего не более 106 символов. Определите максимальное количество идущих подряд символов, среди которых не более шести точек и более 15 гласных букв (AEIOUY)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "75466afd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "592\n"
     ]
    }
   ],
   "source": [
    "from collections import defaultdict\n",
    "file = open(r\"D:\\informaticsclass\\egeinfo\\24\\24_M3__42nfh.txt\")\n",
    "file = file.readline()\n",
    "\n",
    "d = defaultdict(int)\n",
    "p = mx = start = 0\n",
    "for end in range(len(file)):\n",
    "    if file[end] in \"AEIOUY\":\n",
    "        d[file[end]] += 1\n",
    "    if file[end] == \".\":\n",
    "        p += 1\n",
    "\n",
    "    while p > 6:\n",
    "        if file[start] in \"AEIOUY\":\n",
    "            d[file[end]] -= 1\n",
    "        if file[start] == \".\":\n",
    "            p -= 1\n",
    "        start += 1\n",
    "    if p <= 6 and sum(d.values()) > 15:\n",
    "        mx = max(mx, end - start + 1)\n",
    "print(mx)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f57ca577",
   "metadata": {},
   "source": [
    "Текстовый файл состоит из символов T,U,V,W,X,Y и Z.\n",
    "Определите в прилагаемом файле максимальное количество идущих подряд символов (длину непрерывной подпоследовательности), среди которых символ T   встречается ровно 100 раз.\n",
    "Для выполнения этого задания следует написать программу"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ec155199",
   "metadata": {},
   "outputs": [],
   "source": [
    "file = open(r\"D:\\informaticsclass\\egeinfo\\24\\24_2024__7aiiq.txt\")\n",
    "file = file.readline()\n",
    "\n",
    "mx = t = start = 0\n",
    "for end in range(len(file)):\n",
    "    if file[end] == \"T\":\n",
    "        t += 1\n",
    "    while t > 100:\n",
    "        if file[start] == \"T\":\n",
    "            t -= 1\n",
    "        start += 1\n",
    "    if t == 100:\n",
    "        mx = max(mx, end - start + 1)\n",
    "\n",
    "print(mx)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3a9f5eea",
   "metadata": {},
   "source": [
    "Текстовый файл содержит только заглавные буквы латинского алфавита. Определите максимальное количество идущих подряд символов, \n",
    "среди которых каждая из букв F, L встречается не более трех раз."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "38d1c50c",
   "metadata": {},
   "outputs": [],
   "source": [
    "file = open(r\"D:\\informaticsclass\\egeinfo\\24\\24_18__3b9tx.txt\").readline()\n",
    "\n",
    "mx = f = l = start = 0\n",
    "for end in range(len(file)):\n",
    "    if file[end] == \"F\":\n",
    "        f += 1\n",
    "    if file[end] == \"L\":\n",
    "        l += 1\n",
    "    \n",
    "    while f > 3 or l > 3:\n",
    "        if file[start] == \"F\":\n",
    "            f -= 1\n",
    "        if file[start] == \"L\":\n",
    "            l -= 1\n",
    "        start += 1\n",
    "    if f <= 3 and l <= 3:\n",
    "        mx = max(mx, end - start + 1)\n",
    "print(mx)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f3b30c0a",
   "metadata": {},
   "source": [
    "Текстовый файл состоит не более чем из 106 символов латинского алфавита. Определите длину минимальной подстроки, содержащей не менее 100 символов Y.\n",
    "\n",
    "Для выполнения этого задания следует написать программу."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5b1a263f",
   "metadata": {},
   "outputs": [],
   "source": [
    "f = open(r\"D:\\informaticsclass\\egeinfo\\24\\24_16__3b9u2.txt\").readline()\n",
    "\n",
    "start = y = 0\n",
    "mn = 10 ** 7\n",
    "\n",
    "for end in range(len(f)):\n",
    "    if f[end] == \"Y\":\n",
    "        y += 1\n",
    "\n",
    "    while y > 100:\n",
    "        if f[start] == \"Y\":\n",
    "            y -= 1\n",
    "        start += 1\n",
    "    \n",
    "    if y == 100:\n",
    "        mn = min(mn, end - start + 1)\n",
    "\n",
    "print(mn)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6024ec38",
   "metadata": {},
   "source": [
    "Текстовый файл 24_4.txt состоит из символов A, C, D, F и O.\n",
    "\n",
    "Определите в прилагаемом файле максимальное количество идущих подряд символов (длину непрерывной подпоследовательности), среди которых символ D встречается не более 100 раз.\n",
    "\n",
    "Для выполнения этого задания следует написать программу."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9672ae87",
   "metadata": {},
   "outputs": [],
   "source": [
    "f = open(r\"D:\\informaticsclass\\egeinfo\\24\\24_4__3b9tg.txt\").readline()\n",
    "\n",
    "mx = start = d = 0\n",
    "\n",
    "for end in range(len(f)):\n",
    "    if f[end] == \"D\":\n",
    "        d += 1\n",
    "    \n",
    "    while d > 100:\n",
    "        if f[start] == \"D\":\n",
    "            d -= 1\n",
    "        \n",
    "        start += 1\n",
    "    \n",
    "    if d <= 100:\n",
    "        mx = max(mx, end - start + 1)\n",
    "print(mx)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv (3.13.2)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
