{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "bf7e0974",
   "metadata": {},
   "source": [
    "№ 18258 (Уровень: Сложный)\n",
    "\n",
    "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите наибольший номер строки таблицы, для чисел которой выполнены оба условия:\n",
    "– числа в строке расположены в порядке неубывания;\n",
    "– в строке есть повторяющиеся числа с чётной суммой цифр.\n",
    "\n",
    "В ответе запишите только число."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "1b95bb5c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6937\n"
     ]
    }
   ],
   "source": [
    "file = open(r\"D:\\informaticsclass\\egeinfo\\hometask\\9_18258.csv\")\n",
    "cnt = 0\n",
    "ans = []\n",
    "for line in file:\n",
    "    cnt += 1\n",
    "    line = list(map(int, line.split(\";\")))\n",
    "    n1 = [True for i in range(1, len(line)) if line[i - 1] <= line[i]]\n",
    "    n2 = [i for i in line if line.count(i) > 1]\n",
    "    n2 = [i for i in n2 if sum(list(map(int, list(str(i))))) % 2 == 0]\n",
    "    if n1 and n2:\n",
    "        ans.append(cnt)\n",
    "print(max(ans))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "de1ec420",
   "metadata": {},
   "source": [
    "Ну вроде изичное"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b7ed1b1e",
   "metadata": {},
   "source": [
    "\t\n",
    "№ 13824 (Уровень: Сложный)\n",
    "\n",
    "(Л. Шастин) Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите сумму номеров строк таблицы, для чисел которых выполнены оба условия:\n",
    "– в строке чётность всех соседних чисел различна;\n",
    "– утроенная сумма неповторяющихся чисел строки не меньше произведения повторяющихся чисел.\n",
    "В ответе запишите только число.\n",
    "\n",
    "Примечание. Если в строке повторяющихся чисел нет, произведение следует принять равным нулю."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "9aad2f58",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1611486\n"
     ]
    }
   ],
   "source": [
    "from math import prod\n",
    "file = open(r\"D:\\informaticsclass\\egeinfo\\hometask\\9_13824.csv\")\n",
    "cnt = 0\n",
    "ans = []\n",
    "for line in file:\n",
    "    cnt += 1\n",
    "    line = list(map(int, line.split(\";\")))\n",
    "    n1 = [True for i in range(1, len(line)) if (line[i - 1] % 2) != (line[i] % 2)]\n",
    "    n2 = [i for i in line if line.count(i) > 1]\n",
    "    if not n2:\n",
    "        n2 = [0]\n",
    "    if len(n1) == len(line) - 1 and sum(n2) * 3 >= prod(n2):\n",
    "        ans.append(cnt)\n",
    "print(sum(ans))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9ec2e458",
   "metadata": {},
   "source": [
    "Тут не понял прикола ответ прям на чуть чуть отличается (1671305), хз че не так"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv (3.13.2)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
