{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "ea42335c",
   "metadata": {},
   "source": [
    "№ 3765 (Уровень: Гроб)\n",
    "\n",
    "Пусть N(k) = 1 850 000 000 + k, где k – натуральное число. Найдите пять наименьших значений k, при которых N(k) имеет нечётное количество различных чётных делителей. В ответе запишите найденные значения k в порядке возрастания, справа от каждого значения запишите число чётных делителей N(k)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fb7b6e66",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n"
     ]
    },
    {
     "ename": "",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31mThe Kernel crashed while executing code in the current cell or a previous cell. \n",
      "\u001b[1;31mPlease review the code in the cell(s) to identify a possible cause of the failure. \n",
      "\u001b[1;31mClick <a href='https://aka.ms/vscodeJupyterKernelCrash'>here</a> for more info. \n",
      "\u001b[1;31mView Jupyter <a href='command:jupyter.viewOutput'>log</a> for further details."
     ]
    }
   ],
   "source": [
    "from collections import defaultdict\n",
    "from math import prod\n",
    "def sieve(n):\n",
    "    lst = [*range(2, n + 1)]\n",
    "    for sym in lst:\n",
    "        if sym == 0:\n",
    "            continue\n",
    "        for i in range(sym ** 2 - 2, len(lst), sym):\n",
    "            lst[i] = 0\n",
    "    return [i for i in lst if i]\n",
    "\n",
    "def denom(n):\n",
    "    ans = defaultdict(int)\n",
    "    den = 0\n",
    "    lst_of_prost = sieve(n)\n",
    "    while n != 1:\n",
    "        a = lst_of_prost[den]\n",
    "        if n % a == 0:\n",
    "            n //= a\n",
    "            ans[a] += 1\n",
    "        else:\n",
    "            den += 1\n",
    "    return ans\n",
    "\n",
    "# тоесть нужно чтобы степень двойки была нечетной а степени других простых четными\n",
    "ans = []\n",
    "k = 1\n",
    "n_k = 185 * 10 ** 7 + k\n",
    "while len(ans) < 5:\n",
    "    den = denom(n_k)\n",
    "    try:\n",
    "        pow_2 = den[2]\n",
    "    except:\n",
    "        k += 1\n",
    "        continue\n",
    "    n1 = all([(value % 2 == 0 or key == 2) for key, value in den.items()])\n",
    "    if not n1:\n",
    "        k += 1\n",
    "        continue\n",
    "    true_powers = [value + 1 for key, value in den.items() if key != 2]\n",
    "    ans.append((k, prod(true_powers)))\n",
    "    k += 1\n",
    "\n",
    "[print(i) for i in ans]"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "314ab3ef",
   "metadata": {},
   "source": [
    "долго сидел думал что не так, по итогу проиграл этой задаче"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9c497b94",
   "metadata": {},
   "source": [
    "№ 5226 (Уровень: Сложный)\n",
    "\n",
    "(М. Ишимов) Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:\n",
    "\n",
    "— символ «?» означает ровно одну произвольную цифру;\n",
    "\n",
    "— символ «*» означает любую последовательность цифр произвольной длины; в том числе «*» может задавать и пустую последовательность.\n",
    "\n",
    "Например, маске 123*4?5 соответствуют числа 123405 и 12300405. Среди натуральных чисел, превышающих 109, найдите 5 наименьших чисел, соответствующие маске 1*2*7*04 и имеющих ровно 45 делителей. В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце – соответствующие им максимальные делители, не считая самого числа."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1c927076",
   "metadata": {},
   "outputs": [],
   "source": [
    "from fnmatch import fnmatch\n",
    "from collections import defaultdict\n",
    "from math import prod\n",
    "\n",
    "def sieve(n):\n",
    "    lst = [*range(2, n + 1)]\n",
    "    for sym in lst:\n",
    "        if sym == 0:\n",
    "            continue\n",
    "        for i in range(sym ** 2 - 2, len(lst), sym):\n",
    "            lst[i] = 0\n",
    "    return [i for i in lst if i]\n",
    "\n",
    "def denom(n, pr):\n",
    "    ans = defaultdict(int)\n",
    "    den = 0\n",
    "    lst_of_prost = pr\n",
    "    while n != 1:\n",
    "        a = lst_of_prost[den]\n",
    "        if n % a == 0:\n",
    "            n //= a\n",
    "            ans[a] += 1\n",
    "        else:\n",
    "            den += 1\n",
    "    return ans\n",
    "\n",
    "pr = sieve(10**9)\n",
    "\n",
    "n = 10 ** 9\n",
    "cnt = 0\n",
    "while cnt < 5:\n",
    "    n += 1\n",
    "    if not fnmatch(str(n), \"1*2*7*04\"):\n",
    "        continue\n",
    "    a = denom(n, pr)\n",
    "    n1 = prod([i + 1 for i in list(a.values())])\n",
    "    if n1 == 45:\n",
    "        print(n, n // min(a.keys()))\n",
    "        cnt += 1"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "370b6f9b",
   "metadata": {},
   "source": [
    "Один ответ нашелся) 101042704 50521352"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.14.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
